docs/comp-sci/sml/implementations.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implementations - SML</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Implementations - SML</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-542dda25-92a9-4242-981a-326396c9d891">1. Poly/ML</a></li>
<li><a href="#h-a474e941-9a4f-45e9-bf6c-0434934dfe24">2. MLton</a>
<ul>
<li><a href="#h-c96a1a4f-8997-4297-b4a6-4d2446fac78d">2.1. On Raspberry Pi</a>
<ul>
<li><a href="#h-d3cc257f-9ad7-4953-9db1-abbed247e1f7">2.1.1. Remote Compiling</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-bb7d9bf3-a0a6-49d5-9e9c-dd3d65df7515">3. SML/NJ</a></li>
<li><a href="#h-8bee04cc-0008-4a29-af61-8d0d0203aeb3">4. MLKit</a></li>
</ul>
</div>
</div>
<p>
This is just a cursory "How to build [SML implementation] on Raspberry
Pi" post.
</p>

<div id="outline-container-h-542dda25-92a9-4242-981a-326396c9d891" class="outline-2">
<h2 id="h-542dda25-92a9-4242-981a-326396c9d891"><span class="section-number-2">1.</span> Poly/ML</h2>
<div class="outline-text-2" id="text-h-542dda25-92a9-4242-981a-326396c9d891">
<p>
This seems to work fine. If you have a 32-bit ARM computer, then it will
simply compile bytecode, which will run considerably slower. The basic
steps <a href="https://www.polyml.org/download.html">seems to be:</a>
</p>

<pre class="example" id="org82e7b61">
~/src/$ git clone https://github.com/polyml/polyml.git
~/src/polyml/$ cd polyml
~/src/polyml/$ ./configure
~/src/polyml/$ make
~/src/polyml/$ make compiler
~/src/polyml/$ sudo make install
</pre>

<p>
It may be worth considering upgrading to a Raspberry Pi 3B+ or 4, since
Apple has transitioned to 64-bit ARM (we will end up piggie-backing off
opensource projects transitioning to support 64-bit ARM).
</p>

<p>
Note: since commit <code>15c840d4</code>, the ARM64 performance has improved
drastically.
</p>

<ul class="org-ul">
<li><a href="https://github.com/polyml/polyml">Github page</a> for Poly/ML</li>
</ul>
</div>
</div>

<div id="outline-container-h-a474e941-9a4f-45e9-bf6c-0434934dfe24" class="outline-2">
<h2 id="h-a474e941-9a4f-45e9-bf6c-0434934dfe24"><span class="section-number-2">2.</span> MLton</h2>
<div class="outline-text-2" id="text-h-a474e941-9a4f-45e9-bf6c-0434934dfe24">
<p>
This needs an existing SML compiler for the bootstrap process.
</p>

<p>
I think <code>make polyml-mlton</code> may work as well. Although the <code>make bootstrap-polyml</code>
command may be the intended command.
</p>

<p>
I have tried <code>make MLTON_COMPILE_ARGS="-codegen c" all</code>. I think
<code>-codegen llvm</code> may produce better results?
</p>

<p>
It seems a better approach may be to cross-compile MLton on another
computer. Basically, on my x64 machine with 12GB of RAM, I ran the
following:
</p>

<pre class="example" id="org9bf3c96">
alex@x64:~/src/$ git clone https://github.com/mlton/mlton
alex@x64:~/src/$ cd mlton
alex@x64:~/src/mlton/$ make
...
alex@x64:~/src/mlton/$ make REMOTE_MACHINE=alex@raspberry.local remote-bootstrap
...
</pre>

<p>
If you do this, you might want to have your pubkey on your Raspberry Pi,
otherwise you'll end up logging in several dozen times over the course
of an hour or so. But it works! (I learned about this <code>REMOTE_MACHINE</code>
trick from <a href="https://github.com/MLton/mlton/issues/438">github issues</a>.)
</p>

<p>
Well, right now, it breaks on the <code>$(MAKE) remote--make-all</code> step for me
(c.f., <a href="https://github.com/MLton/mlton/issues/438#issuecomment-849623610">steps</a> in the remote build process).
</p>

<p>
In fact, you might want to run <code>scp ~/.ssh/id_rsa.pub alex@raspberrypi.local:.ssh/authorized_keys</code>
to avoid signing in repeatedly. And if you don't have an RSA key, you
might want to follow <a href="http://web.archive.org/web/20160404025901/http://jaybyjayfresh.com/2009/02/04/logging-in-without-a-password-certificates-ssh/">these instructions</a>.
</p>

<ul class="org-ul">
<li><a href="http://mlton.org/Home">Home page</a></li>
<li><a href="https://github.com/MLton/mlton">Github page</a></li>
<li><a href="http://mlton.org/RunningOnARM">Running on ARM</a> MLton wiki</li>
<li><a href="http://www.mlton.org/pipermail/mlton-devel/2007-June/029877.html">Re: Cross compile on ARM successful</a> MLton mailing list thread</li>
</ul>
</div>

<div id="outline-container-h-c96a1a4f-8997-4297-b4a6-4d2446fac78d" class="outline-3">
<h3 id="h-c96a1a4f-8997-4297-b4a6-4d2446fac78d"><span class="section-number-3">2.1.</span> On Raspberry Pi</h3>
<div class="outline-text-3" id="text-h-c96a1a4f-8997-4297-b4a6-4d2446fac78d">
<p>
This is actually harder than I realized to get this working on a
Raspberry pi 4. What I ended up doing is modifying my
<code>/etc/apt/sources.list</code> to include a Debian repo, then I was able to
<code>sudo apt install mlton</code>. (There is some trickiness here, with
<a href="https://ccm.net/faq/809-debian-apt-get-no-pubkey-gpg-error">pubkey errors</a>.) I then used this to compile MLton from scratch.
</p>

<p>
Another caveat is that this will run into problems if your
<code>/boot/config.txt</code> includes the line specifying it to run in 64-bit
mode. In fact, this borked my installation, and I had to reinstall
Raspbian lite.
</p>
</div>

<div id="outline-container-h-d3cc257f-9ad7-4953-9db1-abbed247e1f7" class="outline-4">
<h4 id="h-d3cc257f-9ad7-4953-9db1-abbed247e1f7"><span class="section-number-4">2.1.1.</span> Remote Compiling</h4>
<div class="outline-text-4" id="text-h-d3cc257f-9ad7-4953-9db1-abbed247e1f7">
<p>
The exact failure is during the <code>remote--make-all</code> step:
</p>

<pre class="example" id="org0260f75">
Compiling mlton
"/tmp/mlton-20210117.153942-gb1f1f0f09/boot/bin/mlton" \
	@MLton ram-slop 0.7  gc-summary -- \
	 -verbose 2 	\
	-target self -output mlton-compile			\
	mlton-stubs.mlb
MLton 20210117.153942-gb1f1f0f09 starting
   Compile SML starting
      frontend starting
         parseAndElaborate starting
make[2]: Leaving directory '/tmp/mlton-20210117.153942-gb1f1f0f09/mlton'
Segmentation fault
make[2]: *** [Makefile:72: mlton-compile] Error 139
make[1]: Leaving directory '/tmp/mlton-20210117.153942-gb1f1f0f09'
make[1]: *** [Makefile:75: compiler] Error 2
make: *** [Makefile:19: all] Error 2
make: *** [Makefile:666: remote--make-all] Error 2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-h-bb7d9bf3-a0a6-49d5-9e9c-dd3d65df7515" class="outline-2">
<h2 id="h-bb7d9bf3-a0a6-49d5-9e9c-dd3d65df7515"><span class="section-number-2">3.</span> SML/NJ</h2>
<div class="outline-text-2" id="text-h-bb7d9bf3-a0a6-49d5-9e9c-dd3d65df7515">
<p>
Doesn't support 32-bit ARM, and intends to support 64-bit ARM in the
next release (2022.1), so it's impossible at the moment (as of January 15,
2022).
</p>

<p>
This is yet another incentive to upgrade to a 64-bit Raspberry Pi&#x2026;
</p>

<ul class="org-ul">
<li><a href="https://www.smlnj.org/">SML/NJ Homepage</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-8bee04cc-0008-4a29-af61-8d0d0203aeb3" class="outline-2">
<h2 id="h-8bee04cc-0008-4a29-af61-8d0d0203aeb3"><span class="section-number-2">4.</span> MLKit</h2>
<div class="outline-text-2" id="text-h-8bee04cc-0008-4a29-af61-8d0d0203aeb3">
<p>
Only supports x86 and Javascript, so I couldn't get it working on my
Raspberry Pi. Formerly, MLKit had a bytecode interpreter, but this was
removed to support Javascript.
</p>

<ul class="org-ul">
<li><a href="https://github.com/melsman/mlkit">Github page</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2022-01-28 Fri 09:13.</p>
</div>
</body>
</html>